Tekla.Structures.ModelInternal.dotPartLine_t
Serialization structure for PartLine.

Tekla.Structures.ModelInternal.dotPartLine_t.PartID
ID of the Part whose Part Line we wish to retrieve.

Tekla.Structures.ModelInternal.dotPartLine_t.PartLineType
The Part Line type. 0 for center line, 1 for reference line.

Tekla.Structures.ModelInternal.dotPartLine_t.PartLineCutted
Defines if Part Line is returned with cuts and fittigs.

Tekla.Structures.ModelInternal.dotPartLine_t.nPoints
Part Line number of points.

Tekla.Structures.ModelInternal.dotPartLine_t.aPoints
The points in the Part Line.